// створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
let areaofRectangle = (a, b) => a * b;
console.log(areaofRectangle(15, 6));

// створити функцію яка обчислює та повертає площу кола з радіусом r
let arreaofcircle= (r) => Math.PI * (r * r);
console.log(arreaofcircle(5));
// створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом
let areaofCilindr = (h, r) => 2 * Math.PI* r * (r + h);
console.log(areaofCilindr(3, 5));
// створити функцію яка приймає масив та виводить кожен його елемент
let arr=[1,5,7,9,15,18]
function arrayPrinter(array){
    for (const item of array){
        console.log(item)
    }
}
arrayPrinter(arr);
// cтворити функцію яка створює параграф з текстом. Текст задати через аргумент
function paragraf(text){
    document.write(`<div>${text}</div>`)
}
paragraf('Колібрієві або коліброві (Trochilidae) — родина дрібних серпокрильцеподібних птахів, що включає 113 родів і 361 вид. Представники цієї родини мешкають в Америці, від Аляски і Лабрадора до Вогняної Землі, багато видів є ендемічними. Широко поширені в тропічних лісах, особливо на середньогір\'ях. Переважну частину раціону колібрієвих складає багатий на вуглеводи солодкий нектар квіткових рослин, який вони добувають за допомогою довгого, чутливого язика. Птахи також доповнюють свій раціон поживними на білок дрібними членистоногими, яких вони ловлять в польоті або знімають з листя і павутиння. Завдяки живленню нектаром, колібрієві є важливими запилювачами рослин, багато рослин Нового Світу запилюється виключно ними.')
// створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

function foo(text){
    for (let i = 0; i < 3; i++) {
       document.write('<ul><li>${text}</li></ul>')
    }
}
foo('')